Revit 2026 API

# PipeFlowConfigurationType Enumeration

---

An enumerated type listing all connector flow configuration

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PipeFlowConfigurationType
```
```vb
Public Enumeration PipeFlowConfigurationType
```
```cpp
public enum class PipeFlowConfigurationType
```
```fsharp
type PipeFlowConfigurationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Calculated | 0 | Flow configuration is calculated |
| Demand | 3 | Flow configuration depends on demand |
| Preset | 1 | Flow configuration is Preset |
| System | 2 | Flow configuration depends on system |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace